SmaRTC-core/load-tests/session-scaling.yml
# ========================================
# Session Scaling Load Test
# Target: 1000 concurrent sessions with varying sizes
# Test mesh network adaptation
# ========================================

config:
  target: "ws://localhost"
  phases:
    # Phase 1: Create small sessions (10-20 users)
    - duration: 120
      arrivalRate: 20
      name: "Small sessions"
    
    # Phase 2: Create medium sessions (20-50 users)
    - duration: 180
      arrivalRate: 30
      name: "Medium sessions"
    
    # Phase 3: Create large sessions (50-100 users)
    - duration: 180
      arrivalRate: 40
      name: "Large sessions"
    
    # Phase 4: Mixed load
    - duration: 240
      arrivalRate: 25
      name: "Mixed session sizes"
  
  engines:
    ws:
      timeout: 120000
  
  ensure:
    maxErrorRate: 3
    p95: 300
    p99: 800

  # Generate session IDs for different sizes
  variables:
    # Small sessions (10-20 users each)
    smallSession:
      - "small-{{ $randomNumber(1, 500) }}"
    
    # Medium sessions (20-50 users each)
    mediumSession:
      - "medium-{{ $randomNumber(1, 200) }}"
    
    # Large sessions (50-100 users each)
    largeSession:
      - "large-{{ $randomNumber(1, 50) }}"
    
    # Very large sessions (100+ users each) - triggers relay mode
    veryLargeSession:
      - "xlarge-{{ $randomNumber(1, 10) }}"

# ========================================
# Test Scenarios
# ========================================
scenarios:
  # Small session test (full mesh expected)
  - name: "Small Session User"
    weight: 40
    engine: ws
    flow:
      - connect:
          url: "/signalhub"
      - send:
          payload: '{"protocol":"json","version":1}'
      - think: 1
      
      - send:
          payload: '{"type":1,"target":"JoinSession","arguments":["{{ smallSession }}","User{{ $randomNumber() }}"]}'
      
      # Simulate WebRTC peer connections
      - loop:
        - send:
            payload: '{"type":1,"target":"SendSignalToSession","arguments":["{{ smallSession }}","{\"type\":\"offer\"}","User{{ $randomNumber() }}"]}'
        - think: 5
        count: 30
      
      - send:
          payload: '{"type":1,"target":"LeaveSession","arguments":["{{ smallSession }}"]}'
  
  # Medium session test (hybrid mode expected)
  - name: "Medium Session User"
    weight: 35
    engine: ws
    flow:
      - connect:
          url: "/signalhub"
      - send:
          payload: '{"protocol":"json","version":1}'
      - think: 1
      
      - send:
          payload: '{"type":1,"target":"JoinSession","arguments":["{{ mediumSession }}","User{{ $randomNumber() }}"]}'
      
      # Enable relay capability (opt-in for better performance)
      - send:
          payload: '{"type":1,"target":"SetRelayCapability","arguments":["{{ $randomBoolean() }}"]}'
      
      - loop:
        - send:
            payload: '{"type":1,"target":"BroadcastSignal","arguments":["{{ mediumSession }}","{\"type\":\"update\"}"]}'
        - think: 3
        count: 40
      
      - send:
          payload: '{"type":1,"target":"LeaveSession","arguments":["{{ mediumSession }}"]}'
  
  # Large session test (relay mode expected)
  - name: "Large Session User"
    weight: 20
    engine: ws
    flow:
      - connect:
          url: "/signalhub"
      - send:
          payload: '{"protocol":"json","version":1}'
      - think: 1
      
      - send:
          payload: '{"type":1,"target":"JoinSession","arguments":["{{ largeSession }}","User{{ $randomNumber() }}"]}'
      
      # Opt-in as relay node (high bandwidth client)
      - send:
          payload: '{"type":1,"target":"SetRelayCapability","arguments":[true]}'
      
      # Simulate heavy traffic
      - loop:
        - send:
            payload: '{"type":1,"target":"BroadcastSignal","arguments":["{{ largeSession }}","{\"type\":\"video\"}"]}'
        - think: 2
        count: 60
      
      - send:
          payload: '{"type":1,"target":"LeaveSession","arguments":["{{ largeSession }}"]}'
  
  # Very large session test (stress test relay system)
  - name: "XL Session User"
    weight: 5
    engine: ws
    flow:
      - connect:
          url: "/signalhub"
      - send:
          payload: '{"protocol":"json","version":1}'
      - think: 1
      
      - send:
          payload: '{"type":1,"target":"JoinSession","arguments":["{{ veryLargeSession }}","User{{ $randomNumber() }}"]}'
      
      # Heavy relay node
      - send:
          payload: '{"type":1,"target":"SetRelayCapability","arguments":[true]}'
      
      # Long-lived connection with periodic activity
      - loop:
        - send:
            payload: '{"type":1,"target":"Heartbeat","arguments":[]}'
        - think: 15
        - send:
            payload: '{"type":1,"target":"BroadcastSignal","arguments":["{{ veryLargeSession }}","{\"keepalive\":true}"]}'
        - think: 15
        count: 20
      
      - send:
          payload: '{"type":1,"target":"LeaveSession","arguments":["{{ veryLargeSession }}"]}'

# ========================================
# Expected Results
# ========================================
# Total sessions: ~1000
# Small sessions: ~500 (full mesh)
# Medium sessions: ~200 (hybrid)
# Large sessions: ~50 (relay-based)
# Very large sessions: ~10 (heavy relay)
#
# Mesh adaptation triggers:
# - Full mesh: < 20 users ✓
# - Hybrid: 20-50 users ✓
# - Relay: 50+ users ✓
#
# Relay nodes auto-selected: ✓
# Route optimization active: ✓
# No server overload: ✓
# ========================================